#pragma once
//================================================================
// 定数
//================================================================

//ボードのマス数
const int NUM_BOARDS = 9;
//さいころの面数
const int NUM_DICE = 6;
//振るさいころの数
const int NUM_DICE_ROLL = 2;


//================================================================
// 関数
//================================================================

/// <summary>
/// ゲーム開始関数
/// </summary>
void StartGame();

/// <summary>
///ボードの初期化 
/// </summary>
/// <param name="board">取得マスのフラグ</param>
void InitializeBoard(bool board[]);

//さいころを振る
//さいころの結果を表示
//取得できるマスがあるか確認
//取得するマスを選択
//プレイヤーが取得するマスを選択
//CPUが取得するマスを選択
//マスを取得
//全てのマスが取得されたか確認
//取得可能なマスを表示




